# Выведите названия пяти цветов, случайным образом выберите один и предложите сделать то же пользователю. Если пользователь выберет тот же
# цвет, который выбрала программа, выведите сообщение «Well done»; в противном случае выведите ответ, в котором скрывается намек на правильный
# цвет. Предложите пользователю повторить попытку; если пользователь и на
# этот раз не угадает, снова выведите ту же подсказку и предложите выбрать
# цвет (и так далее, пока пользователь не выдаст правильный ответ).

