# Выведите названия пяти цветов, случайным образом выберите один
# и предложите сделать то же пользователю. Если пользователь выберет тот же
# цвет, который выбрала программа, выведите сообщение «Well done»;
# в противном случае выведите ответ, в котором скрывается намек на правильный
# цвет. Предложите пользователю повторить попытку; если пользователь и на
# этот раз не угадает, снова выведите ту же подсказку и предложите выбрать
# цвет (и так далее, пока пользователь не выдаст правильный ответ).

import random
color = random.choice(["білий", "синій", "червоний", "зелений", "чорний"])
select_user = 0
while color != select_user:
    select_user = input("Оберіть колір з (білий, червоний, синій, зелений, чорний): ")
    select_user = select_user.lower()

    if select_user == color:
        print("Неперевершено! Ви вгадали!")
    else:
        if color == "білий":
            print("Сробуйте ще раз - загаданий колір світить з ліхтаря")
        elif color == "синій":
            print("Сробуйте ще раз - загаданий колір згадують коли кажуть про небо")
        elif color == "червоний":
            print("Сробуйте ще раз - загаданий колір порівнюють з вогнем")
        elif color == "зелений":
            print("Сробуйте ще раз - загаданий колір можна побачити у полі")
        elif color == "чорний":
            print("Сробуйте ще раз - загаданий колір майже не відбиває світло")




